{
  "movies": [
    {
      "title": "Меч короля Артура",
      "description": "Молодой Артур живёт на задворках Лондиниума вместе со своей бандой. Он и понятия не имел о своём королевском происхождении, пока однажды не взял в руки меч Эскалибур. Меч начинает менять Артура. В результате он присоединяется к сопротивлению и таинственной молодой девушке по имени Гвиневра. Ему предстоит научиться понимать магическое оружие, которым он овладел, столкнуться со своими собственными демонами и объединить народ в борьбе против диктатора Вортигерна, убившего его родителей и завладевшего короной.",
      "category": "Фантастика",
      "price": 100,
      "image": "https://oc.kg/media/images/9/4/94b1d9e856fb2f132d627e0d79867866/image.jpg",
      "video": "https://p1.oc.kg:8082/video/a/hd4/Mech_korolya_aRTURA720.mp4?an=0",
      "id": "1"
    },
    {
      "title": "Карты, деньги, два ствола(1998)",
      "description": "Четверо молодых парней накопили каждый по 25 тысяч фунтов, чтобы один из них мог сыграть в карты с опытным шулером и матерым преступником, известным по кличке Гарри-Топор. Парень в итоге проиграл 500 тысяч, на уплату долга ему дали неделю.  В противном случае и ему и его «спонсорам» каждый день будут отрубать по пальцу, а потом… Чтобы выйти из положения, ребята решили ограбить бандитов, решивших ограбить трех «ботаников», выращивающих марихуану для местного наркобарона. Но на этом приключения четверки не заканчиваются…",
      "category": "Комедия",
      "price": 120,
      "image": "https://oc.kg/media/images/3/8/38d8bc09148f4f7779690f2befa5019d/image.jpg",
      "video": "https://p1.oc.kg:8082/video/a/24/Lock_Stock_and_2Smoking.mp4?an=0",
      "id": "2"
    },
    {
      "title": "Шерлок Холмс (2009)",
      "description": "Величайший в истории сыщик Шерлок Холмс вместе со своим верным соратником Ватсоном вступают в схватку, требующую нешуточной физической и умственной подготовки, ведь их враг представляет угрозу для всего Лондона.",
      "category": "Детектив",
      "price": 120,
      "image": "https://oc.kg/media/thumbnails/1/5/1580049c577ec65a54213f3d02c88aaa_200x292.jpg",
      "video": "https://p1.oc.kg:8082/video/d/13/Sherlok_Holms_2009.mp4?an=0",
      "id": "3"
    },
    {
      "title": "Один дома(1990)",
      "description": "Американское семейство отправляется из Чикаго в Европу, но в спешке сборов бестолковые родители забывают дома… одного из своих детей. Юное создание, однако, не теряется и демонстрирует чудеса изобретательности. И когда в дом залезают грабители, им приходится не раз пожалеть о встрече с милым крошкой.",
      "category": "Комедия",
      "price": 200,
      "image": "https://oc.kg/media/images/1/9/19f8a097c0dc024dcf98b6965f0a6817/image.jpg",
      "video": "https://p1.oc.kg:8082/video/e/22/Odin_doma_1990.mp4?an=0",
      "id": "4"
    },
    {
      "title": "Вонка (2023)",
      "description": "Задолго до того, как мальчик Чарли вытянул свой счастливый билет и познакомился с удивительным владельцем не менее удивительной шоколадной фабрики, Вилли Вонка был молодым фантазером, великим изобретателем, волшебником и непревзойденным изготовителем шоколада, доступного всем и каждому. Однажды он знакомится с представителем племени пигмеев умпа-лумпа и узнает о существовании страны Лумпаландии, полной опасных хищников и самых экзотических вкусов. Следуя за своей мечтой, Вонка приступает к строительству грандиозной фабрики шоколада, равной которой не будет во всем мире.«Вонка» (2023) — фэнтезийный мюзикл с Тимоти Шаламе в роли эксцентричного шоколатье Вилли Вонки из знаменитой повести Роальда Даля «Чарли и шоколадная фабрика».",
      "category": "Фантастика",
      "price": 150,
      "image": "https://oc.kg/media/thumbnails/5/6/56fcbe3d45e28b52d01a23aa3961fafa_200x300.jpg",
      "video": "https://p1.oc.kg:8082/video/d/hd2/WonkaHD.mp4?an=1",
      "id": "5"
    },
    {
      "title": "Аквамен и потерянное царство",
      "description": "Над Атлантидой нависла новая угроза, способная привести к необратимой катастрофе. Даже Аквамен не сможет справиться в одиночку – ему предстоит заключить неожиданный союз ради спасения своего королевства.",
      "category": "Фантастика",
      "price": 200,
      "image": "https://oc.kg/media/thumbnails/0/c/0c28ae769d9b619f3a772647c85fb906_200x270.jpg",
      "video": "https://p1.oc.kg:8082/video/d/hd2/Aquaman2HD.mp4?an=1",
      "id": "6"
    },
    {
      "id": "fcb3",
      "title": "Астрал",
      "description": "«Астрал» (англ. Insidious) — фильм ужасов о сверхъестественном 2010 года, снятый Джеймсом Ваном по сценарию Ли Уоннелла, с Патриком Уилсоном, Роуз Бирн и Барбарой Херши в главных ролях. Это первая часть франшизы «Астрал» и третья по хронологии сюжета серии. История сосредоточена на супружеской паре, чей мальчик необъяснимым образом впадает в коматозное состояние и становится сосудом для различных демонических существ в астральном плане.",
      "category": "Ужасы",
      "price": 0,
      "image": "https://upload.wikimedia.org/wikipedia/ru/thumb/6/61/Insidious_2011.jpg/200px-Insidious_2011.jpg",
      "video": ""
    },
    {
      "title": "Дитя чудовища",
      "description": "Киюта, потерявшийся в Токио мальчик, проникает в альтернативную вселенную, где его растит борющийся за свое существование человек-медведь по имени Куматетсу. Он долгое время обучает мальчика боевым искусствам. В итоге Киюта становится участником катаклизма, охватившего оба мира.",
      "category": "Аниме",
      "price": 120,
      "image": "https://oc.kg/media/thumbnails/0/e/0e8ac853410f93ffa6a2f6c43c6286d7_200x282.jpg",
      "video": "https://p1.oc.kg:8082/video/b/hd/Bakemono.mp4?an=0",
      "id": "7"
    },
    {
      "title": "Оппенгеймер",
      "description": "стория физика-теоретика Джулиуса Роберта Оппенгеймера, считающегося «отцом атомной бомбы». В 1940-х годах в рамках «Манхэттенского проекта» он руководил разработкой первого ядерного оружия в Лос-Аламосской национальной лаборатории. «Оппенгеймер» (2023) — биографическая драма Кристофера Нолана с Киллианом Мерфи в главной роли, основанная на книге «Американский Прометей: Триумф и трагедия Дж. Роберта Оппенгеймера» Кая Берда и Мартина Дж. Шервина.",
      "category": "История",
      "price": 220,
      "image": "https://oc.kg/media/thumbnails/e/6/e6f6b39132b8f02d63f70234a1ac2928_200x300.jpg",
      "video": "https://p1.oc.kg:8082/video/f/hd2/Oppenheimer_HD.mp4?an=0",
      "id": "8"
    }
  ],
  "categories": [
    {
      "name": "Ужасы",
      "id": "1"
    },
    {
      "name": "Комедия",
      "id": "2"
    },
    {
      "name": "Фантастика",
      "id": "3"
    },
    {
      "name": "Детектив",
      "id": "4"
    },
    {
      "name": "Аниме",
      "id": "5"
    },
    {
      "name": "История",
      "id": "6"
    }
  ],
  "favorites": []
}
